x = input().split()
y = input().split()
l =[]
for x, y in zip(x,y):
    l.append(int(x))
    l.append(int(y))
print(l)


"""Пользователь вводит два списка чисел через пробел. Программа должна создать новый список, в котором элементы из этих списков чередуются: сначала элемент из первого списка, потом из второго, затем следующий из первого и так далее. Для объединения элементов используйте функцию zip()."""

"""

names = ["Alice", "Bob", "Charlie", "David"] 
ages = [25, 30, 35]
print(list(zip(names, ages)))

"""