
names = ['Анна', 'Борис'] 
ages = [28, 34, 45] 
cities = ['Москва', 'Санкт-Петербург'] 

combined = list(zip(names, ages, cities)) 
print(*combined)

"""zip() — это встроенная функция Python, которая принимает несколько итерируемых объектов и возвращает итератор, состоящий из кортежей. Каждый кортеж содержит элементы из переданных итерируемых объектов, расположенные на соответствующих позициях."""


"""Распаковка Списка Кортежей

combined = [('Анна', 28), ('Борис', 34), ('Виктор', 45)] 
names, ages = zip(*combined)

print(names) # Вывод: ('Анна', 'Борис', 'Виктор') 
print(ages) # Вывод: (28, 34, 45) """

"""
zip() объединяет до самой короткой длины. Остальные элементы игнорируются.
Для сохранения всех элементов используйте zip_longest() из модуля itertools.

Для получения списка или другого типа данных используйте функции list(), tuple()
"""
"""Комбинируя zip() с enumerate(), можно получать индексы вместе с объединёнными элементами:

names = ['Анна', 'Борис', 'Виктор'] 
ages = [28, 34, 45] 

for idx, (name, age) in enumerate(zip(names, ages), start=1): 
    print(f"{idx}. {name} - {age} лет") 
Вывод:

1. Анна - 28 лет 
2. Борис - 34 лет 
3. Виктор - 45 лет """


"""
Создание новых списков на основе нескольких итерируемых объектов:

list1 = [1, 2, 3] 
list2 = [4, 5, 6] 

sums = [x + y for x, y in zip(list1, list2)] 
print(sums) # Вывод: [5, 7, 9] 
"""