text = input().split()
t = input().split()
y = set(t)
for index, i  in enumerate(text, start=1):
    for j in y:
        if i == j:
            print(f"Слово \"{j}\" найдено на позиции {index}")

        
"""Напишите программу, которая:

Запрашивает у пользователя текст (одну строку).
Запрашивает у пользователя список ошибочных слов через пробел.
Разбивает введённый текст на список слов.
Находит индексы и значения слов из текста, которые содержатся в списке ошибок, и выводит информацию о них.
Если в "ошибочных словах" есть повторы, то их нужно игнорировать."""