try:
    year = int(input())

    match year:
        case x if x < 0:
            print("Древний мир: Эпоха Древнего Рима.")
        case x if 0 <= x <= 476:
            print("Древний мир: Падение Западной Римской империи.") 
        case x if 477 <= x <= 1492:
            print("Средневековье: Эпоха крестовых походов.")
        case x if 1493 <= x <= 1789:
            print("Эпоха Возрождения: Расцвет искусства и науки.") 
        case x if 1790 <= x <= 1914:
            print("Новое время: Индустриальная революция.") 
        case 1945:
            print("Новейшее время: Окончание Второй мировой войны.")
        case x if 1915 <= x <= 2025:
            print("Новейшее время: Современная эпоха.")
        case x if x >= 2026:
            print("Год находится за пределами известных эпох.")
        case _:
            print("Ошибка: введите числовое значение года.")
except ValueError:
    print("Ошибка: введите числовое значение года.")