zona = input()
d = {
"Арктический": "Северный полюс.",
"Тропический": "Африка, Южная Америка, Юго-Восточная Азия.",
"Умеренный": "Европа, Северная Америка, Азия.",
"Пустынный": "Африка, Австралия, Южная Америка."}
match zona:
    case "Арктический":
        print(f"Эта климатическая зона встречается в:", d[zona])
    case "Тропический":
        print(f"Эта климатическая зона встречается в:", d[zona])
    case "Умеренный":
        print(f"Эта климатическая зона встречается в:", d[zona])
    case "Пустынный":
        print(f"Эта климатическая зона встречается в:", d[zona])
    case _:
        print("Введите другое значение")



"""
data = [1, 2, 3, 4] 

match data: 
    case [1, y, 3, 4]: 
        print(f"Средний элемент: {y}") 
    case _: 
        print("Данные не подходят.") 
"""