flower = input()
t = int(input())
if flower != "Роза" and flower != "Лаванда" and flower != "Тюльпан":
    print("Я не знаю, как ухаживать за таким цветком. Пожалуйста, уточните его тип.")
if flower == "Роза":
    if t < 15:
        print("Необходимо увеличить температуру, чтобы роза не замерзла.")
    elif t > 25:
        print("Оставьте розу в тени, чтобы избежать перегрева.")
    elif 15 <= t <= 20:
        print("Роза чувствует себя прекрасно, продолжайте уход.")
if flower == "Лаванда":
    if t < 10:
        print("Лаванда замерзнет при такой температуре, поместите её в более тёплое место.")
    elif t > 30:
        print("Лаванда не любит жару, переместите её в тень.")
    elif  10 <= t <= 30:
        print("Лаванда в идеальных условиях, наслаждайтесь её цветением.")
if flower == "Тюльпан":
    if t < 5:
        print("Тюльпан не переживёт такую холодную погоду, перенесите его в более тёплое место.")
    elif t > 20:
        print("Тюльпан начинает вянуть, переместите его в более прохладное место.")
    elif 5 <= t <= 20:
        print("Тюльпан наслаждается хорошими условиями, продолжайте ухаживать.")