total_coins = 0
total = 0
day = 0
while  total_coins < 100:
    total = int(input())
    total_coins += total
    day += 1
print("Вы накопили", total_coins, "монет за", day, "дней!\n""Поздравляем! Теперь у вас достаточно золота, чтобы купить меч.")

""""
значально у вас 0 монет. Храните это значение в переменной total_coins = 0.
В цикле while каждый раз запрашивайте у пользователя, сколько монет он заработал за день (введите целое число).
Добавляйте введённое количество к total_coins.
Считайте, сколько дней прошло (например, счётчик days).
Когда total_coins станет 100 или больше, цикл должен прерваться.
В конце выведите, сколько дней потребовалось, и общее количество накопленных монет."""