for i in range(3): 
    for j in range(3): 
        if j == 1: 
            continue 
        print(i, j, end=", ")
'''ответ: 0 0, 0 2, 1 0, 1 2, 2 0, 2 2,'''
"""Закохдим в цикл i , начинаем с 0. Спускаемся в цикл j c 0 и проходим его до 2 (3 -не включительно), получаем: 00, 02 (один пропускаем по continue - как не желательное условие). Цикл j  закончен, поднимаемся наверх в i: далее продолжаем 1, из j - 0, 0 из i, 2 из j- итог: 10, 12.
Далее берем из i - 2, из j -0, потом 2. Получаем- 20, 20. Полный ответ: 00, 02, 10, 12, 20, 22"""