"""index(value, start=0, end=len(list))"""

numbers = [10, 20, 30, 20] 
print(numbers.index(30)) # показывает место элемента(первое, которое встречается, даже если есть повторы)

"""  ----------------------------------
count(value)

Возвращает количество вхождений элемента в список.
"""

fruits = ['apple', 'banana', 'apple'] 
print(fruits.count('apple')) # 2 

""" ----------------------------------
sort(key=None, reverse=False)

Сортирует элементы списка.
Можно указать параметр key для сортировки по определённому критерию.
Параметр reverse=True сортирует список в обратном порядке.
"""

numbers = [3, 1, 4, 1, 5] 
numbers.sort() 
print(numbers) # [1, 1, 3, 4, 5] 

""" ----------------------------------
reverse()

Меняет порядок элементов на обратный.

"""
letters = ['a', 'b', 'c'] 
letters.reverse() 
print(letters) # ['c', 'b', 'a'] 

"""------------------------------------
copy()

"""
original = [1, 2, 3] 
copy_list = original.copy() 
print(copy_list) # [1, 2, 3] 

"""----------------
append()

Используется для добавления одного элемента в конец списка.
Изменяет исходный список.
"""
numbers = [1, 2, 3] 
numbers.append(4) 
print(numbers) # [1, 2, 3, 4] 

""" --------------------------------------
extend()

Добавляет элементы из другого списка или итерируемого объекта (например, строки).
В отличие от append(), элементы добавляются по отдельности, а не как единый объект.
"""
fruits = ['apple', 'banana'] 
fruits.extend(['orange', 'kiwi']) 
print(fruits) # ['apple', 'banana', 'orange', 'kiwi']

"""------------------------------
insert(index, element)

Вставляет элемент в определённое место списка.
Элементы сдвигаются вправо.
"""
colors = ['red', 'blue', 'green'] 
colors.insert(1, 'yellow') 
print(colors) # ['red', 'yellow', 'blue', 'green'] 


"""--------------------------
remove(value)

Удаляет первое вхождение элемента с указанным значением.
Если элемента нет, возникает ошибка.
"""
animals = ['cat', 'dog', 'cat'] 
animals.remove('cat') 
print(animals) # ['dog', 'cat'] 

""" -------------------------------------------
pop(index)

Удаляет элемент по индексу и возвращает его.
По умолчанию удаляет последний элемент, если индекс не указан
"""
items = [10, 20, 30] 
popped_item = items.pop(1) 
print(popped_item) # 20 print(items) # [10, 30] 